package second_exam;

public class Settings {
    public final static String START_GAME = "Каждое утро Лисёнок просыпался, завтракал и шёл увидеться с Бельчонком." +
            " Это утро не было исключением. " + "Лисёнок пришёл на их обычное место встречи, но Бельчонка там не было. \n" +
            "Лисёнок ждал, ждал, но так и не смог дождаться своего друга.\" Бельчонок не пропустил еще ни одной встречи, " +
            "вдруг он попал в беду.\" - подумал Лисёнок. Как поступить Лисенку?";
    //варианты выбора
    public final static String OPTION_1 = "1. Вернуться домой";
    public final static String OPTION_2 = "2. Отправиться на поиски";
    public final static String OPTION_3 = "1. Попытаться разузнать о Бельчонке у лесных жителей";
    public final static String OPTION_4 = "2. Искать Бельчонка в одиночку";
    public final static String OPTION_5 = "1. Расспросить Сову";
    public final static String OPTION_6 = "2. Расспросить Волка";
    public final static String OPTION_7 = "1. Поверить Сове и отправиться вглубь леса";
    public final static String OPTION_8 = "2. Сове не стоит верить. Искать Бельчонка в одиночку";
    public final static String OPTION_9 = "1. Волк прав. Вернуться домой";
    public final static String OPTION_10 = "2. Искать Бельчонка в одиночку";
    public final static String OPTION_11 = "1. Нет, потрачено слишком много времени, нужно идти дальше. Искать Бельчонка в одиночку";
    public final static String OPTION_12 = "2. Нужно воспользоваться шансом и раздобыть мёд";
    public final static String OPTION_13 = "1. Подождать, вдруг пчёлы улетят";
    public final static String OPTION_14 = "2. Нужно попытаться выкрасть мёд немедленно";
    public final static String OPTION_15 = "1. Поесть немного и передохнуть";
    public final static String OPTION_16 = "2. Скорее отнести мёд Медвежонку";
    public final static String OPTION_17 = "1. Медвежонок ничего не знает, нужно продолжить поиски. Искать Бельчонка в одиночку";
    public final static String OPTION_18 = "2. Может быть он прав и Лисёнок просто паникует. Вернуться домой";
    //основные события
    public final static String START_OPTION_1 = "Вернувшись домой, Лисёнок нашёл там Бельчонка. Оказалось, что Бельчонок пришёл на место встречи раньше и увидел там рой злобных пчел.\n" +
            " Он поспешил предупредить об этом Лисёнка, но они разминулись. Наконец-то друзья нашли друг друга! Игра завершилась успехом";
    public final static String START_OPTION_2 = "Все лесные жители были заняты своими делами и не обращали внимания на Лисёнка и его проблему. " +
            "Но вдруг кто нибудь видел Бельчонка... Лисёнок не знал, что ему делать. Помогите ему.";
    public final static String START_OPTION_3 = "Пока Лисёнок принимал решение, лесные жители разошлись кто куда. Остались только Сова и Волк. " +
            "Но у Совы бывают проблемы с памятью, а Волк может сильно разозлиться из-за расспросов. Кого выбрать?";
    public final static String START_OPTION_4 = "Лисёнок слишком долго плутал по лесу в поисках друга и сам не заметил, как заблудился. " +
            "Теперь его самого нужно искать. Игра завершилась неудачей";
    public final static String START_OPTION_5 = "Сова долго не хотела говорить, но в итоге сказала, что видела испуганного Бельчонка, бежавшего вглубь леса.\n" +
            " Все лесные жители знают, что в глубине леса опасно, если Бельчонок там, ему срочно нужна помощь.";
    public final static String START_OPTION_6 = "Волк оказался вполне дружелюбным, но помочь не смог. Лишь сказал, что маленькому лисенку не стоит бродить по лесу одному." +
            " И как теперь поступить?";
    public final static String START_OPTION_7 = "Вернувшись домой, Лисёнок нашёл там Бельчонка. Оказалось, что Бельчонок пришёл на место встречи раньше и увидел там рой злобных пчел.\n" +
            " Он поспешил предупредить об этом Лисёнка, но они разминулись. Наконец-то друзья нашли друг друга! Игра завершилась успехом";
    public final static String START_OPTION_8 = "Лисёнок слишком долго плутал по лесу в поисках друга и сам не заметил, как заблудился. " +
            "Теперь его самого нужно искать. Игра завершилась неудачей";
    public final static String START_OPTION_9 = "В глубине леса Лисёнок встретил Медвежонка. Ленивый Медвежонок был готов рассказать все, что знает, если Лисёнок принесёт ему мёда.";
    public final static String START_OPTION_10 = "Лисёнок быстро нашёл мёд, но вокруг летал рой злобных пчел. Лисёнок всегда боялся пчёл, но и не найти друга он тоже боялся.";
    public final static String START_OPTION_11 = "Лисёнок слишком долго плутал по лесу в поисках друга и сам не заметил, как заблудился. " +
            "Теперь его самого нужно искать. Игра завершилась неудачей";
    public final static String START_OPTION_12 = "Это была не лучшая идея. Пчёлы покусали Лисёнка, теперь ему самому нужна помощь. Игра завершилась неудачей";
    public final static String START_OPTION_13 = "Лисёнок подождал немного, и пчёлы разлетелись. Лисёнок без проблем набрал мёда. Вдруг он понял, что очень голоден. Что же делать?";
    public final static String START_OPTION_14 = "Довольный Медвежонок рассказал Лисёнку, что очень хорошо знает семью Белок и уверен, что Бельчонок никогда не пошёл бы в глубь леса. " +
            "Он заверял Лисёнка, что Белки не попадают в неприятности, и что Совам нельзя верить, он также уговаривал Лисёнка вернуться домой.";
    public final static String START_OPTION_15 = "Пока Лисёнок ел, злобные пчёлы вернулись и покусали его. Лисёнку нужна помощь, он не сможет продолжить поиски. " +
            "Игра завершилась неудачей";
    public final static String START_OPTION_16 = "Вернувшись домой, Лисёнок нашёл там Бельчонка. Оказалось, что Бельчонок пришёл на место встречи раньше и увидел там рой злобных пчел.\n" +
            " Он поспешил предупредить об этом Лисёнка, но они разминулись. Наконец-то друзья нашли друг друга! Игра завершилась успехом";
    public final static String START_OPTION_17 = "Лисёнок слишком долго плутал по лесу в поисках друга и сам не заметил, как заблудился. " +
            "Теперь его самого нужно искать. Игра завершилась неудачей";
    //меню
    public final static String START = "1. Начать игру";
    public final static String SAVE = "4. Сохранить игру";
    public final static String LOAD = "2. Загрузить игру";
    public final static String EXIT = "3. Выйти";
    public final static String EXIT_TO_MENU = "5. Выйти в меню";
    public final static String MENU = "Меню";

}
